app/Services/AdminLoginService.php

    public function attemptLogin(string $email, string $password): array
    {
        // 1. Cari user di tabel user_admin
        $user = $this->db->table('user_admin')
            ->where('email', $email)
            ->get()->getRowArray();

        if (!$user || !password_verify($password, $user['password'])) {
            throw new RuntimeException('Email atau Password salah.');
        }

        // 2. Ambil permissions dari tabel roles
        $roleData    = $this->db->table('roles')->where('role_name', $user['role'])->get()->getRowArray();
---
SELECT *
FROM `user_admin`
WHERE `email` = 'admin@pasangin.com'
SELECT *
FROM `roles`
WHERE `role_name` = 'super_admin'