app/Services/DashboardService.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'client'
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
SELECT COUNT(*) AS `numrows`
FROM `tukang`
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT `order_items`.*, `products`.`name` as `product_name`, `products`.`photo` as `product_photo`, SUM(order_items.quantity) as total_sales, `products`.`price` as `product_price`, `suppliers`.`name` as `supplier_name`
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
LEFT JOIN `suppliers` ON `suppliers`.`id` = `products`.`supplier_id`
GROUP BY `order_items`.`product_id`
ORDER BY `total_sales` DESC
 LIMIT 5
SELECT `withdrawal_requests`.*, `tukang`.`name` as `tukang_name`
FROM `withdrawal_requests`
LEFT JOIN `tukang` ON `tukang`.`id` = `withdrawal_requests`.`tukang_id`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getDashboardStats(): array
    {
        // 1. Statistik Dasar (Counters)
        $counters = [
            'jumlahClient'   => $this->userModel->where('role', 'client')->countAllResults(),
            'jumlahSupplier' => $this->supplierModel->countAllResults(),
            'jumlahTukang'   => $this->tukangModel->countAllResults(),
            'jumlahProduk'   => $this->productModel->countAllResults(),
        ];

        // 2. Data Grafik Penjualan (6 Bulan Terakhir)
        $salesData = $this->getMonthlySalesData();

        // 3. Top 5 Produk Terlaris
        $topProducts = $this->orderItemsModel->select('order_items.*, products.name as product_name, products.photo as product_photo, SUM(order_items.quantity) as total_sales, products.price as product_price, suppliers.name as supplier_name')
            ->join('products', 'products.id = order_items.product_id')
            ->join('suppliers', 'suppliers.id = products.supplier_id', 'left')
            ->groupBy('order_items.product_id')
            ->orderBy('total_sales', 'DESC')
            ->limit(5)
            ->findAll();

        // 4. 5 Permintaan Tarik Dana Terbaru
        $tarikDana = $this->withdrawalRequestsModel->select('withdrawal_requests.*, tukang.name as tukang_name')
            ->join('tukang', 'tukang.id = withdrawal_requests.tukang_id', 'left')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();

SELECT DATE_FORMAT(created_at, '%Y-%m') as month, COUNT(id) as total_orders, SUM(total_price) as total_revenue
FROM `orders`
WHERE `created_at` >= '2025-12-01'
GROUP BY `month`
ORDER BY `month` ASC
---
    private function getMonthlySalesData(): array
    {
        $sixMonthsAgo = date('Y-m-01', strtotime('-5 months'));
        $salesQuery   = $this->orderModel->select("DATE_FORMAT(created_at, '%Y-%m') as month, COUNT(id) as total_orders, SUM(total_price) as total_revenue")
            ->where('created_at >=', $sixMonthsAgo)
            ->groupBy("month")
            ->orderBy("month", "ASC")
            ->get();