app/Services/OrderService.php

    public function getAllOrdersWithItems(): array
    {
        $orders = $this->orderModel
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT *
FROM `orders`
ORDER BY `id` DESC

    private function getItemsByOrderId(int $orderId): array
    {
        return $this->orderItemsModel
            ->select('order_items.*, products.name as product_name, suppliers.name as supplier_name')
            ->join('products', 'products.id = order_items.product_id')
            ->join('suppliers', 'suppliers.id = products.supplier_id')
            ->where('order_items.order_id', $orderId)
            ->findAll();
---
SELECT `order_items`.*, `products`.`name` as `product_name`, `suppliers`.`name` as `supplier_name`
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
JOIN `suppliers` ON `suppliers`.`id` = `products`.`supplier_id`
WHERE `order_items`.`order_id` = 15