app/Services/ProductService.php

SELECT `products`.*, `suppliers`.`name` as `supplier_name`
FROM `products`
LEFT JOIN `suppliers` ON `suppliers`.`id` = `products`.`supplier_id`
---
    public function getAllProducts(): array
    {
        return $this->productModel
            ->select('products.*, suppliers.name as supplier_name')
            ->join('suppliers', 'suppliers.id = products.supplier_id', 'left')
            ->findAll();