app/Services/UserService.php

    public function getAllClients(): array
    {
        return $this->userModel
            ->where('role', 'client')
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'client'
ORDER BY `id` DESC

    public function findUserOrFail(int $id): array
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 12

    public function updateStatus(int $id, string $status): void
    {
        if (!in_array($status, self::ALLOWED_STATUSES, true)) {
            throw new RuntimeException('Status tidak valid: ' . $status);
        }

        // Pastikan user ada sebelum mengupdate
        $this->findUserOrFail($id);

        if (!$this->userModel->save([
            'id'     => $id,
            'status' => $status,
        ])) {
---
UPDATE `users` SET `status` = 'pending', `updated_at` = '2026-05-02 22:17:06'
WHERE `users`.`id` IN (12)