app/Controllers/Admin/Construction.php

SELECT *
FROM `construction_requests`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Konstruksi',
            'projects' => $this->db->table('construction_requests')->orderBy('created_at', 'DESC')->get()->getResultArray()

SELECT `construction_requests`.*, `users`.`full_name`, `users`.`email`, `users`.`phone_number`
FROM `construction_requests`
LEFT JOIN `users` ON `users`.`id` = `construction_requests`.`user_id`
WHERE `construction_requests`.`id` = '19'
SELECT *
FROM `construction_progress`
WHERE `construction_id` = '19'
ORDER BY `week_number` DESC
SELECT *
FROM `construction_designs`
WHERE `construction_id` = '19'
ORDER BY `created_at` DESC
SELECT *
FROM `construction_surveys`
WHERE `construction_id` = '19'
ORDER BY `created_at` DESC
SELECT *
FROM `construction_invoices`
WHERE `construction_id` = '19'
ORDER BY `created_at` ASC
SELECT *
FROM `construction_jobs`
WHERE `construction_id` = '19'
SELECT *
FROM `job_applications`
WHERE `project_id` = '19'
AND `project_type` = 'construction'
ORDER BY `created_at` DESC
SELECT *
FROM `construction_targets`
WHERE `construction_id` = '19'
SELECT `group_name`, SUM(total_price) as total_price
FROM `construction_rabs`
WHERE `construction_rabs`.`construction_id` = '19'
GROUP BY `roman_number`
ORDER BY `roman_number` ASC
SELECT *
FROM `construction_rabs`
WHERE `construction_id` = '19'
ORDER BY `roman_number` ASC, `id` ASC
SELECT `rab_material_options`.*, `products`.`name` as `material_name`, `products`.`price`
FROM `rab_material_options`
JOIN `products` ON `products`.`id` = `rab_material_options`.`product_id`
WHERE `rab_id` = '17'
SELECT *
FROM `products`
WHERE `status` = 'aktif'
---
    public function detail($id)
    {
        $construction = $this->constructionModel
                            ->select('construction_requests.*, users.full_name, users.email, users.phone_number')
                            ->join('users', 'users.id = construction_requests.user_id', 'left')
                            ->find($id);

        if (!$construction) {
            return redirect()->to(base_url('admin/construction'))->with('error', 'Data tidak ditemukan.');
        }

        // --- 1. AMBIL DATA RELASI ---
        $progressList = $this->db->table('construction_progress')->where('construction_id', $id)->orderBy('week_number', 'DESC')->get()->getResultArray();
        $designList   = $this->db->table('construction_designs')->where('construction_id', $id)->orderBy('created_at', 'DESC')->get()->getResultArray();
        $surveyList   = $this->db->table('construction_surveys')->where('construction_id', $id)->orderBy('created_at', 'DESC')->get()->getResultArray();
        $invoiceList  = $this->db->table('construction_invoices')->where('construction_id', $id)->orderBy('created_at', 'ASC')->get()->getResultArray();
        $jobInfo      = $this->db->table('construction_jobs')->where('construction_id', $id)->get()->getRowArray();
        $applicants   = $this->db->table('job_applications')->where('project_id', $id)->where('project_type', 'construction')->orderBy('created_at', 'DESC')->get()->getResultArray();
        $targetList   = $this->db->table('construction_targets')->where('construction_id', $id)->get()->getResultArray();

        // list tagihan
        $list_tagihan = $this->db->table('construction_rabs')
                                ->select('group_name, SUM(total_price) as total_price')
                                ->where('construction_rabs.construction_id', $id)
                                ->groupBy('roman_number','group_name')
                                ->orderBy('roman_number', 'ASC')
                                ->get()->getResultArray();

        // --- 2. AMBIL DATA RAB  ---
        $rabList = $this->db->table('construction_rabs')
                            ->where('construction_id', $id)
                            ->orderBy('roman_number', 'ASC')
                            ->orderBy('id', 'ASC')
                            ->get()->getResultArray();

        // Ambil pilihan material untuk setiap baris RAB
        foreach ($rabList as &$item) {
            $item['materials'] = $this->db->table('rab_material_options')
                                          ->select('rab_material_options.*, products.name as material_name, products.price')
                                          ->join('products', 'products.id = rab_material_options.product_id')
                                          ->where('rab_id', $item['id'])
                                          ->get()->getResultArray();
        }

        // --- 3. AMBIL DATA PRODUK UNTUK MODAL SELECTION ---
        $allProducts = $this->db->table('products')->where('status', 'aktif')->get()->getResultArray();

SELECT *
FROM `construction_targets`
WHERE `construction_id` = '19'
AND `id_construction_rabs` = '18'
UPDATE `construction_targets` SET `id_job_applications` = 13, `start_week` = '2', `end_week` = '3', `bobot` = '17.40'
WHERE `id` = '41'
INSERT INTO `construction_targets` (`id_job_applications`, `start_week`, `end_week`, `bobot`, `construction_id`, `id_construction_rabs`) VALUES (13, '4', '6', '26.86', '19', '18')
---
    public function createTarget($id_project){
        $rab_id    = $this->request->getPost('rab_id');
        $startDate = $this->request->getPost('start_week');
        $week      = $this->request->getPost('end_week');
        $bobot     = $this->request->getPost('bobot');

        $data = [
            'id_job_applications'  => 13,
            'start_week'           => $startDate,
            'end_week'             => $week,
            'bobot'                => $bobot,
        ];

        // Cek apakah target untuk RAB ini sudah ada
        $existing = $this->db->table('construction_targets')
                             ->where('construction_id', $id_project)
                             ->where('id_construction_rabs', $rab_id)
                             ->get()->getRowArray();

        if ($existing) {
            $this->db->table('construction_targets')
                     ->where('id', $existing['id'])
                     ->update($data);
            $msg = 'Target diperbarui!';
        } else {
            $data['construction_id']      = $id_project;
            $data['id_construction_rabs'] = $rab_id;
            $this->db->table('construction_targets')->insert($data);