app/Controllers/Admin/Login.php

    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $emailInput    = $this->request->getVar('email');
        $passwordInput = $this->request->getVar('password');

        // Cari user yang emailnya cocok dan memiliki role admin/superadmin
        $user = $model->where('email', $emailInput)
                      ->whereIn('role', ['admin', 'superadmin'])
                      ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@pasangin.com'
AND `role` IN ('admin','superadmin')
 LIMIT 1